In [1]:
%load_ext sql

In [2]:
%sql sqlite://

In [18]:
cursor = conn.cursor()

In [9]:
import sqlite3

In [23]:
conn = sqlite3.connect('stud_db.sqlite')

In [25]:
cursor.execute('''CREATE TABLE personal_details (
                   national_ID INTEGER PRIMARY KEY,
                   stud_ID VARCHAR(15),
                   stud_name VARCHAR(100),
                   phone_number VARCHAR(15),
                   age INTEGER,
                   gender VARCHAR(10)
                )''')

In [26]:
conn.commit()

In [28]:
%%sql CREATE TABLE personal_details (
    national_ID INTEGER PRIMARY KEY,
    stud_ID VARCHAR(15),
    stud_name VARCHAR(100),
    phone_number VARCHAR(15),
    age INTEGER,
    gender VARCHAR(10)
);

 * sqlite://
Done.

[]

In [29]:
%%sql INSERT INTO personal_details (national_ID, stud_ID, stud_name, phone_number, age, gender)
VALUES
    (344534, 'stud101', 'Hermione Granger', '0712345678', 20, 'Male'),
    (379683, 'stud102', 'Draco Malfo', '0723456781', 21, 'Female'),
    (347403, 'stud103', 'Jayden Wamashati', '0734567812', 22, 'Male'),
    (377302, 'stud104', 'Ron Weasley', '0745678123', 19, 'Female'),
    (336741, 'stud105', 'Dolores Umbridge', '0756781234', 21, 'Male'),
    (307243, 'stud106', 'Hedwig Tonks', '0767812345', 21, 'Female'),
    (310932, 'stud107', 'Chao Chang', '0778123456', 22, 'Male'),
    (343920, 'stud108', 'Curfew Yaeitpm', '0781234567', 20, 'Female'),
    (345261, 'stud109', 'Chaptr Mukenya', '0722345678', 20, 'Male'),
    (339152, 'stud110', 'Natalie Mpema', '0733456781', 21, 'Female'),
    (339746, 'stud111', 'Crew Nundi', '0744567812', 20, 'Male'),
    (336373, 'stud112', 'Bandi Kagunda', '0755678123', 22, 'Female'),
    (325252, 'stud113', 'Testimony Omolo', '0766456781', 21, 'Male'),
    (321746, 'stud114', 'Career Mpya', '0741367812', 20, 'Male'),
    (390234, 'stud115', 'Deamon Anduro', '0744421123', 22, 'Female');

 * sqlite://
15 rows affected.

[]

In [30]:
%%sql CREATE TABLE school_details (
    stud_ID VARCHAR(15) PRIMARY KEY,
    current_home_county VARCHAR(20),
    secondary_school_county VARCHAR(20),
    residence VARCHAR(15),
    stud_email VARCHAR(50)
);

 * sqlite://
Done.

[]

In [31]:
%%sql INSERT INTO school_details (stud_ID)
SELECT stud_ID
FROM personal_details;

 * sqlite://
15 rows affected.

[]

In [34]:
%%sql UPDATE school_details
SET stud_email = (
    SELECT REPLACE(stud_name, ' ', '') || '@zinduaschool.ac'
    FROM personal_details
    WHERE school_details.stud_ID = personal_details.stud_ID
);

 * sqlite://
15 rows affected.

[]

In [35]:
%%sql UPDATE school_details SET current_home_county="Nakuru", secondary_school_county="Nairobi", residence="In school" WHERE stud_ID="stud101";
UPDATE school_details SET current_home_county="Nairobi", secondary_school_county="Nakuru", residence="In school" WHERE stud_ID="stud102";
UPDATE school_details SET current_home_county="Samburu", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud103";
UPDATE school_details SET current_home_county="Kericho", secondary_school_county="Nairobi", residence="In school" WHERE stud_ID="stud104";
UPDATE school_details SET current_home_county="Nyamira", secondary_school_county="Nakuru", residence="In school" WHERE stud_ID="stud105";
UPDATE school_details SET current_home_county="Kisumu", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud106";
UPDATE school_details SET current_home_county="Nakuru", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud107";
UPDATE school_details SET current_home_county="Kisumu", secondary_school_county="Mombasa", residence="Out of school" WHERE stud_ID="stud108";
UPDATE school_details SET current_home_county="Kericho", secondary_school_county="Mombasa", residence="In school" WHERE stud_ID="stud109";
UPDATE school_details SET current_home_county="Nakuru", secondary_school_county="Mombasa", residence="In school" WHERE stud_ID="stud110";
UPDATE school_details SET current_home_county="Kiambu", secondary_school_county="Turkana", residence="In school" WHERE stud_ID="stud111";
UPDATE school_details SET current_home_county="Nairobi", secondary_school_county="Nakuru", residence="In school" WHERE stud_ID="stud112";
UPDATE school_details SET current_home_county="Samburu", secondary_school_county="Taita Taveta", residence="In school" WHERE stud_ID="stud113";
UPDATE school_details SET current_home_county="Kericho", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud114";
UPDATE school_details SET current_home_county="Kiambu", secondary_school_county="Mombasa", residence="In school" WHERE stud_ID="stud115";

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [36]:
%%sql UPDATE school_details SET current_home_county="Nakuru", secondary_school_county="Nairobi", residence="In school" WHERE stud_ID="stud101";

 * sqlite://
1 rows affected.

[]

In [38]:
%%sql SELECT * FROM school_details WHERE stud_ID="stud101";

 * sqlite://
Done.

[('stud101', 'Nakuru', 'Nairobi', 'In school', 'HermioneGranger@zinduaschool.ac')]

In [39]:
%%sql CREATE TABLE contact_details (stud_email VARCHAR(50) , phone_number VARCHAR(15), next_of_kin_name VARCHAR(50),next_of_kin_relation VARCHAR(10), next_of_kin_contacts VARCHAR(13) );

 * sqlite://
Done.

[]

In [40]:
%%sql INSERT INTO contact_details(phone_number, next_of_kin_name,next_of_kin_relation,next_of_kin_contacts)
VALUES("0712345678","Darius Young","Father","0782382383"),
("0723456781","Lucy Nderitu","Mother","0723238983"),
("0734567812","Jerotich Koech","Mother","0779343126"),
("0745678123","Mwaura Mwangi","Father","0798246347"),
("0756781234","Ian Patrick","Father","0711234453"),
("0767812345","Lebron James","Father","0765439233"),
("0778123456","Magna Carter","Father","0702526243"),
("0781234567","Cindy Wayne","Mother","0747282839"),
("0722345678","Farah Maalim","Mother","0753927482"),
("0733456781","Faiba Mbugua","Father","0713245748"),
("0744567812","John Doe","Father","0725737383"),
("0755678123","Klaus Michealson","Father","0789346276"),
("0766456781","Suluhu Amdany","Mother","0785739259"),
("0741367812","Daisy Auma","Mother","0791344537"),
("0755421123","Getrude Karen","Mother","0765748244");

 * sqlite://
15 rows affected.

[]

In [41]:
%%sql
UPDATE contact_details
SET stud_email = (SELECT school_details.stud_email
FROM school_details, personal_details
WHERE school_details.stud_ID = personal_details.stud_ID
AND personal_details.phone_number = contact_details.phone_number);

 * sqlite://
15 rows affected.

[]

In [45]:
%%sql ALTER TABLE contact_details
ADD COLUMN stud_email_new VARCHAR(50);

 * sqlite://
Done.

[]

In [46]:
%%sql CREATE TABLE financial_details (stud_ID VARCHAR(15) ,stud_name VARCHAR(50) ,
sem_fee INTEGER(6) , fee_paid INTEGER(6),
PRIMARY KEY(stud_ID) );

 * sqlite://
Done.

[]

In [47]:
%%sql INSERT INTO financial_details(stud_ID,stud_name)
SELECT personal_details.stud_ID, personal_details.stud_name
FROM personal_details;

 * sqlite://
15 rows affected.

[]

In [48]:
%%sql UPDATE financial_details SET sem_fee = 25000, fee_paid=25000 WHERE stud_ID = "stud101";
UPDATE financial_details SET sem_fee= 25000, fee_paid=19000 WHERE stud_ID = "stud102";
UPDATE financial_details SET sem_fee= 21900, fee_paid=20000 WHERE stud_ID = "stud103";
UPDATE financial_details SET sem_fee= 22000, fee_paid=22000 WHERE stud_ID = "stud104";
UPDATE financial_details SET sem_fee= 25000, fee_paid=23400 WHERE stud_ID = "stud105";
UPDATE financial_details SET sem_fee= 25000, fee_paid=27000 WHERE stud_ID = "stud106";
UPDATE financial_details SET sem_fee= 24230, fee_paid=21200 WHERE stud_ID = "stud107";
UPDATE financial_details SET sem_fee= 25000, fee_paid=23500 WHERE stud_ID = "stud108";
UPDATE financial_details SET sem_fee= 25000, fee_paid=24500 WHERE stud_ID = "stud109";
UPDATE financial_details SET sem_fee= 25000, fee_paid=25000 WHERE stud_ID = "stud110";
UPDATE financial_details SET sem_fee= 26000, fee_paid=26000 WHERE stud_ID = "stud111";
UPDATE financial_details SET sem_fee= 25000, fee_paid=20900 WHERE stud_ID = "stud112";
UPDATE financial_details SET sem_fee= 25000, fee_paid=22300 WHERE stud_ID = "stud113";
UPDATE financial_details SET sem_fee= 19000, fee_paid=19000 WHERE stud_ID = "stud114";
UPDATE financial_details SET sem_fee= 20800, fee_paid=20800 WHERE stud_ID = "stud115";

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]


Using JOIN get the student names, school id, email, phone number (new_stud_details)

In [53]:
%%sql SELECT
    pd.stud_name AS student_name,
    sd.stud_ID AS school_id,
    sd.stud_email AS email,
    pd.phone_number AS phone_number
FROM
    personal_details pd
JOIN
    school_details sd ON pd.stud_ID = sd.stud_ID;

 * sqlite://
Done.

[('Hedwig Tonks', 'stud106', 'HedwigTonks@zinduaschool.ac', '0767812345'),
 ('Chao Chang', 'stud107', 'ChaoChang@zinduaschool.ac', '0778123456'),
 ('Career Mpya', 'stud114', 'CareerMpya@zinduaschool.ac', '0741367812'),
 ('Testimony Omolo', 'stud113', 'TestimonyOmolo@zinduaschool.ac', '0766456781'),
 ('Bandi Kagunda', 'stud112', 'BandiKagunda@zinduaschool.ac', '0755678123'),
 ('Dolores Umbridge', 'stud105', 'DoloresUmbridge@zinduaschool.ac', '0756781234'),
 ('Natalie Mpema', 'stud110', 'NatalieMpema@zinduaschool.ac', '0733456781'),
 ('Crew Nundi', 'stud111', 'CrewNundi@zinduaschool.ac', '0744567812'),
 ('Curfew Yaeitpm', 'stud108', 'CurfewYaeitpm@zinduaschool.ac', '0781234567'),
 ('Hermione Granger', 'stud101', 'HermioneGranger@zinduaschool.ac', '0712345678'),
 ('Chaptr Mukenya', 'stud109', 'ChaptrMukenya@zinduaschool.ac', '0722345678'),
 ('Jayden Wamashati', 'stud103', 'JaydenWamashati@zinduaschool.ac', '0734567812'),
 ('Ron Weasley', 'stud104', 'RonWeasley@zinduaschool.ac', '0745678123'),
 ('Draco Malfo', 'stud102', 'DracoMalfo@zinduaschool.ac', '0723456781'),
 ('Deamon Anduro', 'stud115', 'DeamonAnduro@zinduaschool.ac', '0744421123')]

In [74]:
%%sql CREATE TABLE full_stud_details AS
SELECT
    pd.national_ID,
    pd.stud_ID,
    pd.stud_name,
    pd.phone_number,
    pd.age,
    pd.gender,
    sd.current_home_county,
    sd.secondary_school_county,
    sd.residence,
    cd.next_of_kin_name,
    cd.next_of_kin_relation,
    cd.next_of_kin_contacts,
    fd.sem_fee,
    fd.fee_paid
FROM
    personal_details pd
JOIN
    school_details sd ON pd.stud_ID = sd.stud_ID
JOIN
    contact_details cd ON pd.phone_number = cd.phone_number
JOIN
    financial_details fd ON pd.stud_ID = fd.stud_ID;

 * sqlite://
(sqlite3.OperationalError) table full_stud_details already exists
[SQL: CREATE TABLE full_stud_details AS
SELECT
    pd.national_ID,
    pd.stud_ID,
    pd.stud_name,
    pd.phone_number,
    pd.age,
    pd.gender,
    sd.current_home_county,
    sd.secondary_school_county,
    sd.residence,
    cd.next_of_kin_name,
    cd.next_of_kin_relation,
    cd.next_of_kin_contacts,
    fd.sem_fee,
    fd.fee_paid
FROM
    personal_details pd
JOIN
    school_details sd ON pd.stud_ID = sd.stud_ID
JOIN
    contact_details cd ON pd.phone_number = cd.phone_number
JOIN
    financial_details fd ON pd.stud_ID = fd.stud_ID;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

Add student names on any empty row of stud_name in financial_details

In [58]:
%%sql UPDATE financial_details
SET stud_name = (
    SELECT stud_name
    FROM personal_details
    WHERE personal_details.stud_ID = financial_details.stud_ID
)
WHERE stud_name IS NULL;

 * sqlite://
0 rows affected.

[]

 On the financial_details table add a column, fee_cleared, that has True if student has cleared current fee and False if not (financial_details_view)

In [59]:
%%sql ALTER TABLE financial_details
ADD COLUMN fee_cleared INTEGER;

 * sqlite://
Done.

[]

In [60]:
%%sql UPDATE financial_details
SET fee_cleared = CASE
                      WHEN fee_paid >= sem_fee THEN 1
                      ELSE 0
                  END;

 * sqlite://
15 rows affected.

[]


 Get the national ID and name of all students who have cleared their fees (fee_cleared)

In [61]:
%%sql SELECT p.national_ID, p.stud_name
FROM personal_details p
JOIN financial_details f ON p.stud_ID = f.stud_ID
WHERE f.fee_cleared = 1;

 * sqlite://
Done.

[(307243, 'Hedwig Tonks'),
 (321746, 'Career Mpya'),
 (339152, 'Natalie Mpema'),
 (339746, 'Crew Nundi'),
 (344534, 'Hermione Granger'),
 (377302, 'Ron Weasley'),
 (390234, 'Deamon Anduro')]

 Get the total sum of fees paid so far and the total current deficit (total_fee_balance)

In [62]:
%%sql SELECT
    SUM(fee_paid) AS total_fees_paid,
    SUM(sem_fee - fee_paid) AS total_fee_balance
FROM
    financial_details;

 * sqlite://
Done.

[(339600, 19330)]

 Get the count of students who share a current home county i.e., Say Nairobi, get the number of students whoâ€™s current_home_county is Nairobi, and so on for all available counties (home_county_count)

In [63]:
%%sql SELECT
    current_home_county,
    COUNT(*) AS home_county_count
FROM
    school_details
GROUP BY
    current_home_county;

 * sqlite://
Done.

[('Kericho', 3),
 ('Kiambu', 2),
 ('Kisumu', 2),
 ('Nairobi', 2),
 ('Nakuru', 3),
 ('Nyamira', 1),
 ('Samburu', 2)]

Get the count of Male and/or Female students from each secondary_school_county (secondary_school_count). The table should contain a column for male student count and female student count for each county.

In [66]:
%%sql ALTER TABLE school_details
ADD COLUMN gender VARCHAR(10);

 * sqlite://
Done.

[]

In [67]:
%%sql UPDATE school_details
SET gender = (
    SELECT gender
    FROM personal_details
    WHERE personal_details.stud_ID = school_details.stud_ID
);

 * sqlite://
15 rows affected.

[]

In [68]:
%%sql SELECT
    secondary_school_county,
    SUM(CASE WHEN gender = 'Male' THEN 1 ELSE 0 END) AS male_student_count,
    SUM(CASE WHEN gender = 'Female' THEN 1 ELSE 0 END) AS female_student_count
FROM
    school_details
GROUP BY
    secondary_school_county;

 * sqlite://
Done.

[('Mombasa', 1, 3),
 ('Nairobi', 4, 2),
 ('Nakuru', 1, 2),
 ('Taita Taveta', 1, 0),
 ('Turkana', 1, 0)]

Get the percentage of students who set their next_of_kin as Mother vs those that set it as Father1. (kin_percentage)

In [70]:
%%sql ALTER TABLE personal_details
ADD COLUMN next_of_kin VARCHAR(50);

 * sqlite://
Done.

[]

In [71]:
%%sql UPDATE personal_details
SET next_of_kin = (
    SELECT next_of_kin
    FROM school_details
    WHERE school_details.stud_ID = personal_details.stud_ID
);

 * sqlite://
15 rows affected.

[]

In [72]:
%%sql SELECT
    (CAST(mother_count AS FLOAT) / total_count) * 100 AS mother_percentage,
    (CAST(father_count AS FLOAT) / total_count) * 100 AS father_percentage
FROM
    (SELECT
        COUNT(CASE WHEN next_of_kin = 'Mother' THEN 1 END) AS mother_count,
        COUNT(CASE WHEN next_of_kin = 'Father' THEN 1 END) AS father_count,
        COUNT(*) AS total_count
    FROM
        personal_details) AS counts;

 * sqlite://
Done.

[(0.0, 0.0)]

Create a table with all the details from contacts to school and financial details (full_stud_details)

In [73]:
%%sql CREATE TABLE full_stud_details AS
SELECT
    pd.national_ID,
    pd.stud_ID,
    pd.stud_name,
    pd.phone_number,
    pd.age,
    pd.gender,
    sd.current_home_county,
    sd.secondary_school_county,
    sd.residence,
    cd.next_of_kin_name,
    cd.next_of_kin_relation,
    cd.next_of_kin_contacts,
    fd.sem_fee,
    fd.fee_paid
FROM
    personal_details pd
JOIN
    school_details sd ON pd.stud_ID = sd.stud_ID
JOIN
    contact_details cd ON pd.phone_number = cd.phone_number
JOIN
    financial_details fd ON pd.stud_ID = fd.stud_ID;

 * sqlite://
Done.

[]